{
  "Weeks": [
    {
      "Date": "2020-07-13",
      "Activities": [
        {
          "Category": "work",
          "Items": [
            "I prepped my next YouTube video on rendering buffered data from SWR. This is the first week I missed publishing in a while, and I felt very defeated by it. When the weekend came I knew it'd be too much to try to squeeze in, so I listened to my body and gave myself permission to rest. Ended up having a glorious beach day on Sunday. Still working on finding balance during quarantine + excited to get this video up next week.",
            "We got a GraphQL guide added to the Mirage docs! Excited by the momentum here, driven by Rocky's ongoing excellent work.",
            "We also shipped GraphQL support in the REPL. Few more quality-of-life improvements coming here but excited to start sharing more examples soon.",
            "Published \"Stop Energy\", Ep. 105 of Frontend First.",
            "Published Ep. 7 of Contextual Components in Octane on EmberMap.",
            "Published Ep. 4 of Building UI Components with Storybook on EmberMap. Darin's doing a great job with this series.",
            "Consulting."
          ]
        },
        {
          "Category": "learning",
          "Items": [
            "In my ongoing quest to understand useEffect, I asked a question on Twitter about when a function parameter needs to be invoked inside of an effect. I'm still not confident about any of the answers, but Chris Freeman shared this great article with me on Potentially-Pure Functions. It seems that in a language like JavaScript, the purity of a function can depend on the purity of its arguments. The reason I'm spending so much time trying to understand this is because of this 2019 tweet from Sebastian. I'm still not sure how much this stuff matters outside of a CM/Suspense world."
          ]
        },
        {
          "Category": "interesting-thing",
          "Items": [
            "When leaders should lie.",
            "Framer Motion 2 is out.",
            "Dyanmo's strengths over relational DBs.",
            "Shaders for frontend devs.",
            "Using Bitcoin to verify digital property rights in video games.",
            "Delightful Apple video on working from home."
          ]
        }
      ]
    },
    {
      "Date": "2020-07-06",
      "Activities": [
        {
          "Category": "work",
          "Items": [
            "I published \"The Rule of Least Power\" on YouTube.",
            "We enabled the REPL on miragejs.com! The Shares also now save the request method, URL and body, in addition to the server config. Finally, we debounced updates so typing feels much more responsive.",
            "Rocky Neurock shipped v0.1.0 of @miragejs/graphql! I reviewed his work but it was really all him. Stoked to add GraphQL support to the REPL so we can properly show it off soon. Very excited for this.",
            "Did some consulting, as well as some Mirage maintenance work."
          ]
        },
        {
          "Category": "learning",
          "Items": [
            "Dependabot has been churning through our Netlify build resources for miragejs.com. We automerge in-range dependency updates, so the Netlify preview builds for Dependabot PRs were literally going unused. I learned that you can tell Netlify not to build a PR if the commit message has \"[skip netlify]\" in it, so I customized our Dependabot config to add this – and it worked! Still need to smooth this out a bit as the builds are ignored when merged to master, but for now it is helping alleviate the problem. Check out the for our current config."
          ]
        },
        {
          "Category": "interesting-thing",
          "Items": [
            "Slick embeddable terminals that run in the browser.",
            "Stripe launched a new homepage.",
            "SWR's docs site also got a refresh.",
            "Neat app that rolls up your social feeds into a daily email.",
            "Part 1 of an interview about the technology behind Remix.",
            "...and part 2 on Michael and Ryan's plan to sustain development.",
            "Fascinating interview with Peter Thiel from 2019.",
            "The best product demo I've seen in recent memory."
          ]
        }
      ]
    },
    {
      "Date": "2020-06-29",
      "Activities": [
        {
          "Category": "work",
          "Items": [
            "I published \"Authorizing anonymous users in Hasura using Netlify Functions\" on YouTube.",
            "We deployed a Hasura backend for miragejs.com and shipped Shares to the REPL. Had a lot of fun building this.",
            "Published \"Tech debt vs. platform risk\", Ep. 104 of Frontend First.",
            "Published Darin's video \"Working with Context\", Ep. 3 of Building UI Components with Storybook on EmberMap.",
            "Did some consulting work."
          ]
        },
        {
          "Category": "learning",
          "Items": [
            "Hasura lets you configure permissions for unauthenticated users, which is perfect for making certain queries public (like the blog posts for your homepage) without needing to add support for user accounts. The docs are confusing and also incorrect in a few places, but all you need to do is set the `HASURA_GRAPHQL_UNAUTHORIZED_ROLE` environment variable and it works regardless if you happen to be using either webhooks or JWTs elsewhere."
          ]
        },
        {
          "Category": "interesting-thing",
          "Items": [
            "Stripe launched a customer portal.",
            "Hasura launched a premium hosted version of their platform. Was only a matter of time. Exciting!",
            "Linear, a beautiful web-based productivity app, now has open signups.",
            "Ryan Singer and Adam Wathan chatted about how Shape Up applies to small teams.",
            "React Core Team Q&A."
          ]
        }
      ]
    },
    {
      "Date": "2020-06-22",
      "Activities": [
        {
          "Category": "work",
          "Items": [
            "I published \"React is a programming language for UIs\" on YouTube.",
            "I finally shipped the official Mirage Tutorial! Stoked to figure out my next priority.",
            "Published \"Safety and idempotence\", Ep. 103 of Frontend First.",
            "Published \"Yielding a Divider\", Ep. 6 of Contextual Components with Octane on EmberMap."
          ]
        },
        {
          "Category": "interesting-thing",
          "Items": [
            "Baremetrics launched a minimal Intercom alternative.",
            "Interesting thread on challenges of auth when using a backend-as-a-service.",
            "Neat physical productivity tool.",
            "Video refresher on the story of Last of Us Part 1.",
            "Adding historical context to the current wave of protests.",
            "Taleb's fat tails applied to software projects."
          ]
        }
      ]
    }
  ]
}
